#define _CRT_SECURE_NO_WARNINGS 1
//操作符详解
#include<stdio.h>
//int main()
//{
//	//1.算数操作符---> '+','-','*','/','%'
//	int a = 3 / 5;//整数除法，商0余3
//	int b = 6 / 5;
//	float c = 3.0f / 5;//必须有一边是浮点数，才能计算浮点类型
//	printf("%d\n", a);
//	printf("%d\n", b);
//	printf("%f\n", c);
//
//	int d = 7 % 3;//取模操作数两端必须是整数
//	printf("%d\n", d);
//	return 0;
//}



//移位操作符
//int main()
//	{
//	int a = 2;
//	//把a的二进制位向左移动一位，二进制中，左边丢弃右边补0.
//	int b = a << 1;
//	printf("b = %d\n", b);//b = 4;
//
//	//右移操作符
//	//1.算数右移：右边丢弃，左边补原符号位
//	//2.逻辑右移：右边丢弃，左边补 0
//
//	return 0;
//	}




//位操作符--->   &,|,^ ----操作数必须为整数。
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a & b;
//	int d = a | b;
//	int e = a ^ b;
//	//按位（二进制位）与
//	//00000000000000000000000000000011--->表示3
//	//00000000000000000000000000000101--->表示5
//	//00000000000000000000000000000001--->表示1    0-0->0,0-1->0,1-1->1
//	printf("a & b = %d\n", c);//结果为1
//
//
//	//按位或（|）
//	//00000000000000000000000000000011--->表示3
//	//00000000000000000000000000000101--->表示5
//	//00000000000000000000000000000111--->表示7    0-0->0,0-1->1,1-1->1
//	printf("a | b = %d\n", d);//结果为7
//
//	//按位异或（^），对应的二进制位进行异或
//	//00000000000000000000000000000011--->表示3
//	//00000000000000000000000000000101--->表示5
//	//00000000000000000000000000000110--->表示6     相同为0；相异为1；
//	printf("a ^ b = %d\n", e);//结果为6
//
//
//	//异或操作符的运用
//	//不使用第三个变量，交换a，b的值。
//	printf("交换前：a = %d , b = %d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("交换后：a = %d , b = %d\n", a, b);
//	return 0;
//}


//int main()
//{
//	//赋值操作符---> '=','-=','+=','*='...
//	int a = 15;
//	int b = 99;
//	//一个等号是赋值，两个等号‘==’是判断是否相等
//	int c;
//	c = a = b = 100;
//	printf("%d", c);//赋值操作符可以连续使用，但是不简洁，不利于理解。
//	return 0;
//}


//int main()
//{
	//单目操作符，只有一个操作数的操作符。
	
	//---!---,逻辑反操作
	//int flag = 0;
	//if (flag)
	//{
	//	printf("flag为真");
	//}
	//if(!flag)//flag为假，打印如下（flag为假，则!flag为真，则可以进入if语句）
	//{
	//	printf("flag为假");
	//}

	//正号，负号
	//int a = 10;
	//a = -a;
	//printf("%d\n", a);
	

	//sizeof操作符，计算数据类型/变量/数组的大小，单位都是字节。
	//int a = 10;
	//short b = 5;
	//char arr[10] = { 0 };
	//printf("%d\n", sizeof(a));//计算a所占空间的大小，单位为字节。
	//printf("%d\n", sizeof a );//计算变量是，可以省略括号，但数据类型不可以。


	//printf("%d\n", sizeof(b = a + 5));//打印结果为2，只打印b所占的空间，与空间内的值无关
	//printf("%d\n", sizeof(b));//b = 5;  sizeof()---括号中的内容不参与运算。


	//按位(二进制)取反操作符
	//int c = -1;
	//10000000000000000000000000000001--原码
	//11111111111111111111111111111110--反码
	//11111111111111111111111111111111--补码
	//--补码按位取反
	//11111111111111111111111111111111
	//00000000000000000000000000000000
	//int d = ~c;
	//printf("%d\n", d);
	//return 0;
//}



//自加，自减操作符
//int main()
//{
//	int a = 10;
//	//int b = a++;//后置++  --->  先使用，再++（先使用a 本身，把a=10赋值给b后，a自身再++）
//	int b = ++a;//前置++  --->  先++，再使用（先自增,再赋值）
//				//'--'同理
//
//	printf("%d\n", a);//11
//	//printf("%d\n", b);//10
//	printf("%d\n", b);//111
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	printf("%p\n", &a);//---&取地址操作符
//	int *pa = &a;//pa是一个指针变量，用来存放地址
//	return 0;
//}

//int main()
//{
//	int a = (int)3.14;//强制类型转换
//	printf("%d\n", a);
//	return 0;
//}


//逻辑操作符
//int main()
//{
//	int a = 3;
//	int b = 0;
//	int c = 1;
//	int d = 0;
//	if (a && b)
//	{
//		printf("a&&b为真\n");
//	}
//	if (!(a && b))
//	{
//		printf("a&&b为假\n");
//	}
//	if (c || d)
//	{
//		printf("c||d为真\n");
//	}
//	if (!(c || d))
//	{
//		printf("c||d为假\n");
//	}
//	return 0;
//}


//条件操作符/三目操作符
//int main()
//{
//	int a = 3;
//	int b = 0;
//	if (a > 5)
//	{
//		b = 1;
//	}
//	else
//	{
//		b = -1;
//	}
//	//三目操作符
//	b = (a > 5 ? 1 : -1);//与if...else...逻辑相同
//	return 0;
//}


//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	printf("%d\n", arr[5]);//[]---下标引用操作符
//	return 0;
//}




//Add(x, y)
//{
//	return x + y;
//}
//int main()
//{
//	int a = 10;
//	int b = 20;
//	//函数调用
//	int ret = Add(a, b);//   ()---函数调用操作符。
//	printf("%d\n", ret);
//	return 0;
//}



//结构成员访问操作符
// . 
// ->

//结构体
//int float char short  double  long...
//
//书：书名，书号，出版社，作者，定价
//人：姓名，年龄，性别。。。
//
struct Book//自定义类型---结构体
{
	char name[20];
	char id[20];
	int price;
};
int main()
{
	//普通类型的定义方式
	int num = 10;
	//结构体的定义方式
	struct Book b = { "C语言","20050605",55 };
	printf("书名：%s\n",b.name);//' . '---结构成员操作符
	printf("书号：%s\n",b.id);	//使用形式---‘结构体.成员名’
	printf("书价：%d\n",b.price);
	return 0;
}